
## Plan Result

[CI link](https://github.com/paaaaay5/spajam-kumamoto-infra/actions/runs/5913786569)


<pre><code>Plan: 2 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * aws_iam_policy.ecs_task_ssm
  * aws_iam_role_policy_attachment.ecs_task_ssm_attachment
* Update
  * aws_ecs_cluster.ecs_cluster
  * aws_ecs_service.ecs_service


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_cluster.ecs_cluster will be updated in-place
  ~ resource "aws_ecs_cluster" "ecs_cluster" {
        id       = "arn:aws:ecs:ap-northeast-1:774848854882:cluster/spajam-kumamoto"
        name     = "spajam-kumamoto"
      ~ tags     = {
          - "AWS.SSM.AppManager.ECS.Cluster.ARN" = "arn:aws:ecs:ap-northeast-1:774848854882:cluster/spajam-kumamoto" -> null
        }
      ~ tags_all = {
          - "AWS.SSM.AppManager.ECS.Cluster.ARN" = "arn:aws:ecs:ap-northeast-1:774848854882:cluster/spajam-kumamoto"
        } -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecs_service.ecs_service will be updated in-place
  ~ resource "aws_ecs_service" "ecs_service" {
        id                                 = "arn:aws:ecs:ap-northeast-1:774848854882:service/spajam-kumamoto/spajam-kumamoto"
        name                               = "spajam-kumamoto"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-1:774848854882:task-definition/spajam-kumamoto:2" -> "arn:aws:ecs:ap-northeast-1:774848854882:task-definition/spajam-kumamoto:1"
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_iam_policy.ecs_task_ssm will be created
  + resource "aws_iam_policy" "ecs_task_ssm" {
      + arn         = (known after apply)
      + description = "Permission for ECS tasks to pull from SSM"
      + id          = (known after apply)
      + name        = "spajam-kumamoto-ecs-task-ssm"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_task_ssm_attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_ssm_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "spajam-kumamoto-ecs-task"
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":2,"Program":"tfcmt","SHA1":"b3ce409e7019302f8122ed4b32096a6d76a87a76","Vars":{},"WorkflowName":"Terraform-CICD"} -->